In [ ]:
CREATE TABLE SalaryAudit (
    AuditID INT IDENTITY(1,1),
    EmployeeID INT,
    OldSalary DECIMAL(10, 2),
    NewSalary DECIMAL(10, 2),
    ChangeDate DATETIME DEFAULT GETDATE()
);

In [ ]:
CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY,
    FirstName NVARCHAR(50),
    LastName NVARCHAR(50),
    DepartmentID INT,
    Position NVARCHAR(100),
    Salary DECIMAL(10, 2)
);

In [ ]:
INSERT INTO Employees (EmployeeID, FirstName, LastName, DepartmentID, Position, Salary)
VALUES
    (1, 'John', 'Doe', 101, 'Software Engineer', 70000.00),
    (2, 'Jane', 'Smith', 102, 'HR Manager', 80000.00),
    (3, 'Michael', 'Johnson', 101, 'Database Administrator', 75000.00),
    (4, 'Emily', 'Williams', 103, 'Financial Analyst', 85000.00),
    (5, 'David', 'Brown', 102, 'Recruiter', 60000.00);

In [ ]:
BEGIN TRANSACTION;

-- Update salaries and log changes

UPDATE Employees
SET Salary = Salary * 1.1
OUTPUT INSERTED.EmployeeID, DELETED.Salary, INSERTED.Salary INTO SalaryAudit(EmployeeID, OldSalary, NewSalary)
WHERE DepartmentID = @DepartmentID;

COMMIT TRANSACTION;